content-org/all-posts.en.org
#+hugo_base_dir: ../

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+options: author:nil

** DONE ox-hugo Install Issue with Spacemacs         :emacs:org:@programming:
   :PROPERTIES:
   :EXPORT_FILE_NAME: ox-hugo-install-issue-with-spacemacs.en.md
   :EXPORT_DATE: [2019-10-23 Wed 18:42]
   :END:

   While I try to install [[https://ox-hugo.scripter.co/][ox-hugo]] on my [[http://spacemacs.org/][Spacemacs]], I found an issue:
   #+hugo: more

   After reading the install and [[https://ox-hugo.scripter.co/#usage][usage guide]]. I added ~ox-hugo~
   to ~dotspacemacs-additional-packages~ and also did this:
   #+begin_src emacs-lisp
     (defun dotspacemacs/user-config ()
       ;; Other stuff
       ;; ..

       ;; ox-hugo config
       (use-package ox-hugo
         :ensure t          ;Auto-install the package from Melpa (optional)
         :after ox))
   #+end_src

   *Everything works fine until I restart emacs*:

   ~ox-hugo~ been marked as *an orphan package* and got removed first then
   reinstalled back immediately.

   By searching and digging around the Spacemacs documentation, I found the
   Spacemacs ~org layer~ already has [[http://develop.spacemacs.org/layers/+emacs/org/README.html#hugo-support][org-hugo support by default]] (~development~
   branch only). So we *don't need to follow* the [[https://ox-hugo.scripter.co/][ox-hugo]] usage guide.
   we can do this in ~.spacemacs~
   #+begin_src emacs-lisp
     (setq-default
      dotspacemacs-configuration-layers
      '((org :variables
             org-enable-hugo-support t)))
   #+end_src

   Orphan package and reinstall issue should be fixed now.
